abbench_app1_eraldi_test1.txt
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.11.12.16 (be patient)


Server Software:        Apache/2.4.10
Server Hostname:        10.11.12.16
Server Port:            80

Document Path:          /apps/app1/
Document Length:        5820 bytes

Concurrency Level:      100
Time taken for tests:   85.724 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      6371000 bytes
HTML transferred:       5820000 bytes
Requests per second:    11.67 [#/sec] (mean)
Time per request:       8572.400 [ms] (mean)
Time per request:       85.724 [ms] (mean, across all concurrent requests)
Transfer rate:          72.58 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    7  19.0      1      96
Processing:  2599 8335 1641.9   8433   13650
Waiting:      915 7632 1581.1   7851   12450
Total:       2599 8343 1646.3   8433   13651

Percentage of the requests served within a certain time (ms)
  50%   8433
  66%   8958
  75%   9392
  80%   9563
  90%  10160
  95%  10554
  98%  12394
  99%  12978
 100%  13651 (longest request)