abbench_app2_test1.txt
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.4.10
Server Hostname:        localhost
Server Port:            80

Document Path:          /apps/app2/
Document Length:        10094 bytes

Concurrency Level:      100
Time taken for tests:   483.849 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      10332000 bytes
HTML transferred:       10094000 bytes
Requests per second:    2.07 [#/sec] (mean)
Time per request:       48384.865 [ms] (mean)
Time per request:       483.849 [ms] (mean, across all concurrent requests)
Transfer rate:          20.85 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   6.2      0      22
Processing: 28530 46163 4514.7  45651   73634
Waiting:    28529 46160 4505.7  45647   73633
Total:      28551 46166 4517.0  45651   73656

Percentage of the requests served within a certain time (ms)
  50%  45651
  66%  45753
  75%  45820
  80%  45860
  90%  46018
  95%  51654
  98%  65214
  99%  69772
 100%  73656 (longest request)