abbench_app2_test3.txt
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.4.10
Server Hostname:        localhost
Server Port:            80

Document Path:          /apps/app2/
Document Length:        10094 bytes

Concurrency Level:      100
Time taken for tests:   469.397 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      10332000 bytes
HTML transferred:       10094000 bytes
Requests per second:    2.13 [#/sec] (mean)
Time per request:       46939.724 [ms] (mean)
Time per request:       469.397 [ms] (mean, across all concurrent requests)
Transfer rate:          21.50 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   8.5      0      32
Processing:  1717 44688 6062.2  45749   59128
Waiting:     1716 44684 6061.6  45745   59126
Total:       1744 44691 6057.7  45749   59159

Percentage of the requests served within a certain time (ms)
  50%  45749
  66%  45853
  75%  45922
  80%  45957
  90%  46105
  95%  46339
  98%  53760
  99%  55621
 100%  59159 (longest request)